config.org
#+title: Emacs config
#+author: M3dry

* Table of Contents :TOC:
- [[#config][Config]]
  - [[#completion][Completion]]
    - [[#company][Company]]
    - [[#cape][Cape]]
    - [[#corfu][Corfu]]
      - [[#org-mode-fix][Org mode fix]]
      - [[#doc][Doc]]
      - [[#icons][Icons]]
  - [[#dashboard][Dashboard]]
  - [[#dired][Dired]]
    - [[#keybinds][Keybinds]]
    - [[#vars][Vars]]
  - [[#eval][Eval]]
  - [[#elfeed][Elfeed]]
    - [[#elfeed-goodies][Elfeed goodies]]
    - [[#urls][Urls]]
    - [[#keybinds-1][Keybinds]]
  - [[#evil][Evil]]
    - [[#visual-line][Visual line]]
    - [[#escape][Escape]]
    - [[#global-substitute-by-default][Global substitute by default]]
    - [[#smart-semicolon][Smart semicolon]]
    - [[#truncate-lines][Truncate lines]]
    - [[#undo-limit][Undo limit]]
    - [[#sentence-definition][Sentence definition]]
  - [[#emojis][Emojis]]
    - [[#disabled-emojis][Disabled Emojis]]
  - [[#file-templates][File templates]]
  - [[#fonts][Fonts]]
  - [[#faces][Faces]]
  - [[#frame-opacity][Frame opacity]]
  - [[#frame-title][Frame title]]
  - [[#native-comp][Native comp]]
  - [[#up-list][Up list]]
  - [[#hydra][Hydra]]
    - [[#functions][Functions]]
    - [[#keybinds-2][Keybinds]]
  - [[#ligatures][Ligatures]]
    - [[#org-mode-ligatures][Org mode ligatures]]
    - [[#c-mode-ligatures][C mode ligatures]]
  - [[#line-numbers][Line numbers]]
  - [[#modeline][Modeline]]
    - [[#modules][Modules]]
  - [[#org][Org]]
    - [[#agenda][Agenda]]
    - [[#appear][Appear]]
    - [[#autolist][Autolist]]
    - [[#autotangle][Autotangle]]
    - [[#capture-templates][Capture templates]]
    - [[#contacts][Contacts]]
    - [[#export][Export]]
    - [[#fragtog][Fragtog]]
    - [[#habits][Habits]]
    - [[#keybinds-3][Keybinds]]
    - [[#links][Links]]
    - [[#loggings][Loggings]]
    - [[#looks][Looks]]
    - [[#modules-1][Modules]]
    - [[#ol-tree][Ol tree]]
    - [[#org-directory][Org directory]]
    - [[#priorities][Priorities]]
      - [[#fancy-priorities][Fancy priorities]]
    - [[#properties][Properties]]
    - [[#refile][Refile]]
    - [[#startup][Startup]]
    - [[#sticky-table-header][Sticky table header]]
    - [[#src-block][Src block]]
    - [[#superstar][Superstar]]
    - [[#tags][Tags]]
    - [[#keywords][keywords]]
    - [[#to-lower-case][To lower case]]
    - [[#bullet-size][Bullet size]]
    - [[#table-of-contents][Table of contents]]
    - [[#inline-pdf][Inline pdf]]
    - [[#deft][Deft]]
    - [[#roam][Roam]]
      - [[#journal][Journal]]
      - [[#capture-templates-1][Capture templates]]
      - [[#keybinds-4][Keybinds]]
      - [[#org-agenda][Org agenda]]
  - [[#parrot][Parrot]]
  - [[#projectile][Projectile]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#vertico][Vertico]]
    - [[#posframe][Posframe]]
    - [[#consult][Consult]]
    - [[#affe][Affe]]
  - [[#parens][Parens]]
    - [[#smartparens][Smartparens]]
  - [[#splits][Splits]]
  - [[#select-window][Select window]]
  - [[#super-save][Super save]]
  - [[#theme][Theme]]
  - [[#vterm][Vterm]]
  - [[#which-key][Which key]]
  - [[#world-time][World time]]
  - [[#calendar][Calendar]]
  - [[#page-break-lines][Page break lines]]
  - [[#info-colors][Info colors]]
- [[#init][Init]]
  - [[#modules-2][Modules]]
    - [[#input][Input]]
    - [[#completion-1][Completion]]
    - [[#ui][Ui]]
    - [[#editor][Editor]]
    - [[#emacs][Emacs]]
    - [[#term][Term]]
    - [[#checkers][Checkers]]
    - [[#tools][Tools]]
    - [[#os][Os]]
    - [[#lang][Lang]]
    - [[#email][Email]]
    - [[#app][App]]
    - [[#config-1][Config]]
  - [[#initel][init.el]]
- [[#packages][Packages]]
  - [[#dired-1][Dired]]
  - [[#elfeed-1][Elfeed]]
  - [[#evil-1][Evil]]
  - [[#org-1][Org]]
  - [[#parrot-1][Parrot]]
  - [[#regexp][Regexp]]
  - [[#rotate][Rotate]]
  - [[#snippets][Snippets]]
  - [[#super-save-1][Super save]]
  - [[#whitespace][Whitespace]]
  - [[#posframe-1][Posframe]]
  - [[#completion-2][Completion]]
  - [[#page-break-lines-1][Page break lines]]
  - [[#info-colors-1][Info colors]]

* Config
:PROPERTIES:
:header-args: emacs-lisp: :tangle config.el
:END:
** Completion
*** Company
#+begin_src emacs-lisp :tangle no
(defun cp/company-number ()
  (interactive)
  (let* ((k (this-command-keys))
         (re (concat "^" company-prefix k)))
    (if (cl-find-if (lambda (s) (string-match re s))
                    company-candidates)
        (self-insert-command 1)
      (company-complete-number (string-to-number k)))))

(after! company-box
  (setq company-idle-delay 0.3
        company-tooltip-limit 25
        company-tooltip-idle-delay 0.5
        company-minimum-prefix-length 2)

  (let ((map company-active-map))
    (mapc
     (lambda (x)
       (define-key map (format "%d" x) 'cp/company-number))
     (number-sequence 0 9))
  (define-key map " " (lambda ()
                        (interactive)
                        (company-abort)
                        (self-insert-command 1)))
  (define-key map (kbd "TAB") #'yas-expand)
  (define-key map (kbd "S-TAB") #'yas-expand)))
#+end_src
*** Cape
#+begin_src emacs-lisp
(use-package! cape
  :config
  (map! (:prefix "C-c f"
             :i "p" #'completion-at-point
             :i "d" #'cape-dabbrev
             :i "f" #'cape-file
             :i "k" #'cape-keyword
             :i "i" #'cape-ispell
             :i "s" #'cape-symbol
             :i "t" #'cape-tex))
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword))
#+end_src
*** Corfu
#+begin_src emacs-lisp
(use-package! corfu
  :bind (:map corfu-map
         ("<escape>" . corfu-quit)
         ("C-l" . corfu-insert)
         ("C-j" . corfu-next)
         ("C-k" . corfu-previous))
  :config
  (setq corfu-cycle t
        corfu-auto t
        corfu-auto-prefix 2
        corfu-auto-delay 0.01
        corfu-separator ?\s
        corfu-quit-at-boundary nil
        corfu-quit-no-match t
        corfu-preview-current nil
        corfu-preselect-first t
        corfu-on-exact-match nil
        corfu-echo-documentation t
        corfu-scroll-margin 10)
  (advice-add 'corfu--setup :after 'evil-normalize-keymaps)
  (advice-add 'corfu--teardown :after 'evil-normalize-keymaps)
  (evil-make-overriding-map corfu-map)
  (map! :i "C-e" #'completion-at-point)
  :init
  (corfu-global-mode +1)
  (corfu-doc-mode +1))
#+end_src
**** Org mode fix
#+begin_src emacs-lisp
(after! evil-org
  (map! (:map evil-org-mode-map
         :i "C-j" nil
         :i "C-k" nil
         :i "C-;" nil
         :i "C-l" nil
         :i "<return>" nil
         :i "RET" nil)))
#+end_src
**** Doc
#+begin_src emacs-lisp
(use-package! corfu-doc
  :bind (:map corfu-map
         ("C-;" . corfu-doc-toggle)
         ("C-n" . corfu-doc-scroll-down)
         ("C-p" . corfu-doc-scroll-up))
  :config
  (setq corfu-doc-delay 0.2
        corfu-doc-max-width 80
        corfu-doc-max-height 40)
  :init
  (corfu-doc-mode +1))
#+end_src
**** Icons
#+begin_src emacs-lisp
(use-package! kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src
