config.el
(use-package! cape
  :config
  (map! (:prefix "C-c f"
             :i "p" #'completion-at-point
             :i "d" #'cape-dabbrev
             :i "f" #'cape-file
             :i "k" #'cape-keyword
             :i "i" #'cape-ispell
             :i "s" #'cape-symbol
             :i "t" #'cape-tex))
  :init
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-keyword))

(use-package! corfu
  :bind (:map corfu-map
         ("<escape>" . corfu-quit)
         ("C-l" . corfu-insert)
         ("C-j" . corfu-next)
         ("C-k" . corfu-previous))
  :config
  (setq corfu-cycle t
        corfu-auto t
        corfu-auto-prefix 2
        corfu-auto-delay 0.01
        corfu-separator ?\s
        corfu-quit-at-boundary nil
        corfu-quit-no-match t
        corfu-preview-current nil
        corfu-preselect-first t
        corfu-on-exact-match nil
        corfu-echo-documentation t
        corfu-scroll-margin 10)
  (advice-add 'corfu--setup :after 'evil-normalize-keymaps)
  (advice-add 'corfu--teardown :after 'evil-normalize-keymaps)
  (evil-make-overriding-map corfu-map)
  (map! :i "C-e" #'completion-at-point)
  :init
  (corfu-global-mode +1)
  (corfu-doc-mode +1))

(after! evil-org
  (map! (:map evil-org-mode-map
         :i "C-j" nil
         :i "C-k" nil
         :i "C-;" nil
         :i "C-l" nil
         :i "<return>" nil
         :i "RET" nil)))

(use-package! corfu-doc
  :bind (:map corfu-map
         ("C-;" . corfu-doc-toggle)
         ("C-n" . corfu-doc-scroll-down)
         ("C-p" . corfu-doc-scroll-up))
  :config
  (setq corfu-doc-delay 0.2
        corfu-doc-max-width 80
        corfu-doc-max-height 40)
  :init
  (corfu-doc-mode +1))

(use-package! kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
