config.org
** Dashboard
#+begin_src emacs-lisp
(defvar fancy-splash-image-template
  (expand-file-name "emacs-e-template.svg" doom-private-dir)
  "Default template svg used for the splash image, with substitutions from ")

(defvar fancy-splash-sizes
  `((:height 300 :min-height 50 :padding (0 . 2))
    (:height 250 :min-height 42 :padding (2 . 4))



    (:height 200 :min-height 35 :padding (3 . 3))
    (:height 150 :min-height 28 :padding (3 . 3))
    (:height 100 :min-height 20 :padding (2 . 2))
    (:height 75  :min-height 15 :padding (2 . 1))
    (:height 50  :min-height 10 :padding (1 . 0))
    (:height 1   :min-height 0  :padding (0 . 0)))
  "list of plists with the following properties
  :height the height of the image
  :min-height minimum `frame-height' for image
  :padding `+doom-dashboard-banner-padding' (top . bottom) to apply
  :template non-default template file
  :file file to use instead of template")

(defvar fancy-splash-template-colours
  '(("$colour1" . fg) ("$colour2" . type) ("$colour3" . base5) ("$colour4" . base8))
  "list of colour-replacement alists of the form (\"$placeholder\" . 'theme-colour) which applied the template")

(unless (file-exists-p (expand-file-name "theme-splashes" doom-cache-dir))
  (make-directory (expand-file-name "theme-splashes" doom-cache-dir) t))

(defun fancy-splash-filename (theme-name height)
  (expand-file-name (concat (file-name-as-directory "theme-splashes")
                            theme-name
                            "-" (number-to-string height) ".svg")
                    doom-cache-dir))

(defun fancy-splash-clear-cache ()
  "Delete all cached fancy splash images"
  (interactive)
  (delete-directory (expand-file-name "theme-splashes" doom-cache-dir) t)
  (message "Cache cleared!"))

(defun fancy-splash-generate-image (template height)
  "Read TEMPLATE and create an image if HEIGHT with colour substitutions as
   described by `fancy-splash-template-colours' for the current theme"
  (with-temp-buffer
    (insert-file-contents template)
    (re-search-forward "$height" nil t)
    (replace-match (number-to-string height) nil nil)
    (dolist (substitution fancy-splash-template-colours)
      (goto-char (point-min))
      (while (re-search-forward (car substitution) nil t)
        (replace-match (doom-color (cdr substitution)) nil nil)))
    (write-region nil nil
                  (fancy-splash-filename (symbol-name doom-theme) height) nil nil)))

(defun fancy-splash-generate-images ()
  "Perform `fancy-splash-generate-image' in bulk"
  (dolist (size fancy-splash-sizes)
    (unless (plist-get size :file)
      (fancy-splash-generate-image (or (plist-get size :template)
                                       fancy-splash-image-template)
                                   (plist-get size :height)))))

(defun ensure-theme-splash-images-exist (&optional height)
  (unless (file-exists-p (fancy-splash-filename
                          (symbol-name doom-theme)
                          (or height
                              (plist-get (car fancy-splash-sizes) :height))))
    (fancy-splash-generate-images)))

(defun get-appropriate-splash ()
  (let ((height (frame-height)))
    (cl-some (lambda (size) (when (>= height (plist-get size :min-height)) size))
             fancy-splash-sizes)))

(setq fancy-splash-last-size nil)
(setq fancy-splash-last-theme nil)
(defun set-appropriate-splash (&rest _)
  (let ((appropriate-image (get-appropriate-splash)))
    (unless (and (equal appropriate-image fancy-splash-last-size)
                 (equal doom-theme fancy-splash-last-theme)))
    (unless (plist-get appropriate-image :file)
      (ensure-theme-splash-images-exist (plist-get appropriate-image :height)))
    (setq fancy-splash-image
          (or (plist-get appropriate-image :file)
              (fancy-splash-filename (symbol-name doom-theme) (plist-get appropriate-image :height))))
    (setq +doom-dashboard-banner-padding (plist-get appropriate-image :padding))
    (setq fancy-splash-last-size appropriate-image)
    (setq fancy-splash-last-theme doom-theme)
    (+doom-dashboard-reload)))

(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

(add-hook 'window-size-change-functions #'set-appropriate-splash)
(add-hook 'doom-load-theme-hook #'set-appropriate-splash)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor (list nil))
#+end_src
** Dired
*** Keybinds
#+begin_src emacs-lisp
(map! :leader
      :desc "Dired"
      "d d" #'dired
      :leader
      :desc "Dired jump to current"
      "d j" #'dired-jump)

(after! dired
  (evil-define-key 'normal dired-mode-map
    (kbd "h")   'dired-single-up-directory
    (kbd "l")   'dired-single-buffer
    (kbd "RET") 'dired-open-file
    (kbd "H")   'dired-hide-dotfiles-mode))
#+end_src
*** Vars
#+begin_src emacs-lisp
(setq
 dired-open-extensions
 '(("gif" . "nsxiv -a")
   ("jpg" . "nsxiv")
   ("png" . "nsxiv")
   ("mkv" . "mpv")
   ("mp4" . "mpv"))
 delete-by-moving-to-trash t)
#+end_src
** Eval
#+begin_src emacs-lisp
(setq eros-eval-result-prefix "==> ")

(map! :leader
      :desc "evaluate whole buffer"
      "e b" #'eval-buffer
      :leader
      :desc "evaluate a region"
      "e r" #'eval-region
      :leader
      :desc "evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "evaluate expression before point"
      "e l" #'eval-last-sexp)
#+end_src
** Elfeed
*** Elfeed goodies
#+begin_src emacs-lisp
(require 'elfeed-goodies)
(elfeed-goodies/setup)
(setq elfeed-goodies/entry-pane-size 0.7)
#+end_src
*** Urls
#+begin_src emacs-lisp
(setq elfeed-feeds '(("https://www.reddit.com/r/linux/new.rss" linux reddit)
                    ("https://www.reddit.com/r/linuxmasterrace/new/.rss" linuxmasterrace reddit memes)
                    ("https://blog.tecosaur.com/tmio/rss.xml" org emacs)
                    ("https://www.reddit.com/r/emacs/new.rss" emacs reddit editor)
                    ("https://www.reddit.com/r/neovim/new.rss" vim reddit editor)
                    ("https://www.reddit.com/r/cubers/new.rss" cubing)
                    ("https://www.reddit.com/r/simracing/new.rss" simracing)
                    ("https://www.reddit.com/r/wallstreetbets/new.rss" retards)))
#+end_src
*** Keybinds
#+begin_src emacs-lisp
(map! :leader
      :desc "Launch elfeed"
      "e f" #'elfeed
      :leader
      :desc "Update rss feeds"
      "e u" #'elfeed-update)
#+end_src
** Evil
*** Visual line
#+begin_src emacs-lisp
(map! :mnv "k"   #'evil-previous-visual-line
      :mnv "j"   #'evil-next-visual-line
      :mnv "gk"  #'evil-previous-line
      :mnv "gj"  #'evil-next-line
      :mnv "h"   #'evil-backward-char
      :mnv "l"   #'evil-forward-char)

(map! :i "C-SPC" #'just-one-space)
#+end_src
*** Escape
#+begin_src emacs-lisp
(after! evil-escape
  (setq evil-escape-excluded-major-modes nil
        evil-escape-excluded-states nil
        evil-escape-inhibit-functions nil))
#+end_src
*** Global substitute by default
#+begin_src emacs-lisp
(after! evil (setq evil-ex-substitute-global t))
#+end_src
*** Smart semicolon
#+begin_src emacs-lisp
(use-package! smart-semicolon
  :defer t
  :hook (c-mode . smart-semicolon-mode)
  :config
  (setq smart-semicolon-block-chars '(32 59)))
#+end_src
*** Truncate lines
#+begin_src emacs-lisp
(set-default 'truncate-lines t)

(setq
 truncate-lines t
 truncate-partial-width-windows t)
#+end_src
*** Undo limit
#+begin_src emacs-lisp
(setq undo-limit 80000000)
#+end_src
*** Sentence definition
#+begin_src emacs-lisp
(setq sentence-end-double-space nil)
#+end_src
** Emojis
#+begin_src emacs-lisp
(setq emojify-emoji-set "twemoji-v2")
#+end_src
*** Disabled Emojis
#+begin_src emacs-lisp
(defvar emojify-disabled-emojis
  '("◼" "☑" "☸" "⚙" "⏩" "⏪" "⬆" "⬇" "❓" "✔" "▶" "◀"))

(defadvice! emojify-delete-from-data ()
  :after #'emojify-set-emoji-data
  (dolist (emoji emojify-disabled-emojis)
    (remhash emoji emojify-emojis)))
#+end_src
** File templates
#+begin_src emacs-lisp
(set-file-template! "/LICEN[CS]E$" :trigger '+file-templates/insert-license)
#+end_src
