config.org
** Fonts
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "mononoki Nerd Font Mono" :size 13)
      doom-big-font (font-spec :family "mononoki Nerd Font Mono" :size 16)
      doom-serif-font (font-spec :family "mononoki Nerd Font Mono" :size 13)
      doom-unicode-font (font-spec :family "JoyPixels"))
#+end_src
** Faces
#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :inherit 'italic)
  '(font-lock-keyword-face :inherit 'italic)
  '(font-lock-type-face :inherit 'bold)
  '(org-document-title :foreground "#ffcb6b" :height 1.7 :inherit 'italic)
  '(org-document-info-keyword :foreground "#c792ea" :height 1.4)
  '(org-document-info :height 1.5 :inherit 'italic)
  '(org-date :foreground "#ffcb6b" :height 1.2 :inherit 'italic)
  '(org-block-begin-line :foreground "#82aaff" :background "#232635" :height 1.1 :inherit 'italic :extend t)
  '(org-block-end-line :foreground "#82aaff" :background nil :height 1.1 :inherit 'italic)
  '(org-tag :foreground "#8d92af" :height 0.7)
  '(calendar-weekday-header :foreground "#c792ea"))
#+end_src
** Frame opacity
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(alpha . (100 . 100)))
#+end_src
** Frame title
#+begin_src emacs-lisp
(setq frame-title-format '("%b@" (:eval (or (file-remote-p default-directory 'host) system-name)) " — Emacs"))
#+end_src
** Native comp
#+begin_src emacs-lisp
(setq
 comp-deferred-compilation t
 comp-async-report-warnings-errors nil
 comp-always-compile t)
#+end_src
** Up list
#+begin_src emacs-lisp
(map! :i
      "C-;" #'up-list)
#+end_src
** Hydra
*** Functions
#+begin_src emacs-lisp
(defhydra hd-consult (:exit t
                      :hint nil)
"

 _i_: consult imenu   _a_: consult org agenda   _b_: consult buffer other window
 _t_: consult theme   _d_: consult ma           _B_: consult buffer other frame
                    _f_: consult set font     _m_: consult minor mode menu
                    _h_: affe grep
                    _j_: consul org heading
                    _k_: consul buffer
                    _l_: consult line
                    _;_: affe find
                    _'_: consult find
--------------------------------------------------------------------------------------
 _q_: quit
"
  ("i" consult-imenu)
  ("t" consult-theme)
  ("a" consult-org-agenda)
  ("d" consult-man)
  ("f" consult-set-font)
  ("h" affe-grep)
  ("j" consult-org-heading)
  ("k" consult-buffer)
  ("l" consult-line)
  (";" affe-find)
  ("'" consult-find)
  ("m" consult-minor-mode-menu)
  ("b" consult-buffer-other-window)
  ("B" consult-buffer-other-frame)
  ("q" nil))

(defhydra hd-splits (:timeout 2
                     :hint nil)
"
 ^Windows^
---------------------
 _h_: decrease width
 _k_: decrease height
 _j_: increase height
 _l_: increase width
 _=_: balance windows
---------------------
 _q_: quit
"
  ("h" evil-window-decrease-width)
  ("l" evil-window-increase-width)
  ("k" evil-window-decrease-height)
  ("j" evil-window-increase-height)
  ("=" balance-windows)
  ("q" nil))
#+end_src
*** Keybinds
#+begin_src emacs-lisp
(map! :leader
      :desc "Consult functions"
      "k" #'hd-consult/body
      :leader
      :desc "Resize windows"
      "j" #'hd-splits/body)
#+end_src
** Ligatures
:PROPERTIES:
:header-args: emacs-lisp: :tangle no
:END:
#+begin_src emacs-lisp
(appendq! +ligatures-extra-symbols
          '(;;Org mode
            :checkbox      ""
            :pending       ""
            :checkedbox    ""
            :property      ""
            :title         "﫳"
            :subtitle      ""
            :author        "ﯽ"
            :date          ""
            :options       "⌥"
            :end           ""
            :exclude       ""
            :plot          ""
            :arrow_right   ""
            :arrow_left    ""
            :logbook       ""
            :notangle      ""))
#+end_src
*** Org mode ligatures
#+begin_src emacs-lisp
(set-ligatures! 'org-mode
  :merge t
  :checkbox      "[ ]"
  :pending       "[-]"
  :checkedbox    "[X]"
  :property      "#+property:"
  :property      "#+PROPERTY:"
  :property      ":PROPERTIES:"
  :title         "#+title:"
  :title         "#+TITLE:"
  :subtitle      "#+subtitle:"
  :subtitle      "#+SUBTITLE:"
  :author        "#+author:"
  :author        "#+AUTHOR:"
  :date          "#+date:"
  :date          "#+DATE:"
  :options       "#+options:"
  :options       "#+OPTIONS:"
  :end           ":END:"
  :exclude       "#+exclude_tags:"
  :exclude       "#+EXCLUDE_TAGS:"
  :plot          "#+plot:"
  :plot          "#+PLOT:"
  :arrow_right   "->"
  :arrow_left    "<-"
  :logbook       ":LOGBOOK:"
  :notangle      "#+auto_tangle:"
  :notangle      "#+AUTO_TANGLE:")
#+end_src
*** C mode ligatures
#+begin_src emacs-lisp
(after! cc-mode (set-ligatures! '(c-mode c++-mode)))
#+end_src
** Line numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
** Modeline
#+begin_src emacs-lisp
(setq
 doom-modeline-height 23
 doom-modeline-bar-width 3
 doom-modeline-major-mode-icon t
 doom-modeline-enable-word-count t
 doom-modeline-buffer-file-name-style 'truncate-except-project
 all-the-icons-scale-factor 1)
(defun doom-modeline-conditional-buffer-encoding ()
  (setq-local doom-modeline-buffer-encoding
              (unless (or (eq buffer-file-coding-system 'utf-8-unix)
                          (eq buffer-file-coding-system 'utf-8)))))
(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+end_src
*** Modules
#+begin_src emacs-lisp
(after! doom-modeline
  (doom-modeline-def-modeline 'main
    '(bar matches modals window-number buffer-info remote-host buffer-position word-count selection-info parrot)
    '(irc misc-info input-method buffer-encoding major-mode lsp process vcs checker "  ")))

#+end_src
** Org
*** Agenda
#+begin_src emacs-lisp
(setq
 org-agenda-files '("~/my-stuff/Org/Agenda/")
 org-agenda-skip-scheduled-if-done t
 org-agenda-skip-deadline-if-done t
 org-agenda-include-deadlines t
 org-agenda-start-with-log-mode t
 org-agenda-align-tags-to-column 48
 org-agenda-time-leading-zero t
 org-agenda-skip-timestamp-if-done t
 org-agenda-custom-commands
 '(("o" "Overview"
    ((agenda "" (
                 (org-agenda-prefix-format " %?-12t% s")
                 (org-agenda-span 'week)
                 (org-agenda-start-day "-1d")
                 (org-agenda-overriding-header "⚡ This week")
                 (org-agenda-current-time-string "<----------- Now")
                 (org-agenda-scheduled-leaders '("SCHEDULED: " "Scheduled: "))
                 (org-agenda-deadline-leaders '("DEADLINE: " "Deadline: "))
                 (org-agenda-sorting-strategy '(priority-up))))
     (todo "" (
               (org-agenda-overriding-header "\n⚡ Today")
               (org-agenda-skip-timestamp-if-done t)
               (org-agenda-prefix-format " %?-12t% s")
               (org-agenda-span 'day)
               (org-agenda-start-day "+0d")
               (org-agenda-sorting-strategy '(priority-up))))
     (tags-todo "+PRIORITY=\"A\"" (
                                   (org-agenda-overriding-header "\n⚡ High priority")
                                   (org-agenda-skip-timestamp-if-done t)
                                   (org-agenda-prefix-format " %?-12t% s")))
     (tags-todo "+Effort<=20&+Effort>0" (
                                        (org-agenda-overriding-header "\n⚡ Low effort")
                                        (org-agenda-skip-timestamp-if-done t)
                                        (org-agenda-prefix-format " %?-12t% s")
                                        (org-agenda-sorting-strategy '(priority-up))
                                        (org-agenda-max-todos 10)))
     (todo "TODO" (
                   (org-agenda-overriding-header "\n⚡ To Do")
                   (org-agenda-skip-timestamp-if-done t)
                   (org-agenda-prefix-format " %?-12t% s")
                   (org-agenda-sorting-strategy '(priority-up))))
     (todo "PROJ" (
                   (org-agenda-overriding-header "\n⚡ Projects")
                   (org-agenda-skip-timestamp-if-done t)
                   (org-agenda-prefix-format " %?-12t% s")
                   (org-agenda-sorting-strategy '(priority-up))))))))
#+end_src
*** Appear
#+begin_src emacs-lisp
(use-package! org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoemphasis t
        org-appear-autoentities t)
  (add-hook! 'org-appear-mode-hook
    ;; for proper first-time setup, `org-appear--set-elements' needs to
    ;; be run after other hooks have acted.
    (org-appear--set-elements)
    (add-hook! evil-insert-state-entry :local (org-appear-mode 1))
    (add-hook! evil-insert-state-exit :local (org-appear-mode -1))))
#+end_src
*** Autolist
#+begin_src emacs-lisp
(use-package! org-autolist
  :defer t
  :hook (org-mode . org-autolist-mode))
#+end_src
