config.el
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

(after! org
  (setq org-capture-templates
        `(("t" "Todo")
          ("ti" "Important" entry (file+olp "~/my-stuff/Org/Agenda/Inbox.org" "Important")
           "* TODO %?\n%U")
          ("tt" "Today" entry (file+olp "~/my-stuff/Org/Agenda/Inbox.org" "Today")
           "* TODO %?\n%U")
          ("tl" "Later" entry (file+olp "~/my-stuff/Org/Agenda/Inbox.org" "Later")
           "* TODO %?\n%U")
          ("c" "Contacts" entry (file "~/my-stuff/Org/Agenda/Birthdays.org")
           "* %^{Name} %^G
:PROPERTIES:
:ADDRESS: %^{Address}
:PHONE: %^{Phone number}
:BIRTHDAY: %^{Birthday: yyyy-mm-dd}
:EMAIL: %^{Email}
:NOTE: %^{Note}
:END:")
)))

(setq org-contacts-files '("/home/m3/my-stuff/Org/Agenda/Birthdays.org"))

(setq org-export-with-tags nil)

(use-package! org-fragtog
  :hook
  (org-mode . org-fragtog-mode)
  :config
  (setq org-startup-with-latex-preview t))

(setq org-habit-graph-column 60)

(map! :leader
      :desc "Eval calculations in org doc"
      "o c" #'literate-calc-eval-buffer
      :leader
      :desc "Eval calculation on selected line"
      "o l" #'literate-calc-eval-line
      :leader
      :desc "Counsel org capture"
      "n n" #'org-capture)

(defun or/org-insert-link-dwim ()
  "Like `org-insert-link' but with personal dwim preferences."
  (interactive)
  (let* ((point-in-link (org-in-regexp org-link-any-re 1))
         (clipboard-url (when (string-match-p "^http" (current-kill 0))
                          (current-kill 0)))
         (region-content (when (doom-region-active-p)
                           (buffer-substring-no-properties (doom-region-beginning)
                                                           (doom-region-end)))))
    (cond ((and region-content clipboard-url (not point-in-link))
           (delete-region (doom-region-beginning) (doom-region-end))
           (insert (org-make-link-string clipboard-url region-content)))
          ((and clipboard-url (not point-in-link))
           (insert (org-make-link-string
                    clipboard-url
                    (read-string "title: "
                                 (with-current-buffer (url-retrieve-synchronously clipboard-url)
                                   (dom-text (car
                                              (dom-by-tag (libxml-parse-html-region
                                                           (point-min)
                                                           (point-max))
                                                          'title))))))))
          (t
           (call-interactively 'org-insert-link)))))

(defun or/insert-link ()
  "Insert a link after calling this command twice with the same key."
  (interactive)
  (cond
   ((and (eq last-command #'or/insert-link)
         (eq (char-before) last-command-event))
    (delete-char -1)
    (call-interactively #'or/org-insert-link-dwim))
   (t (insert (string last-command-event)))))

(map! :after org
      :map org-mode-map
      :i "[" #'or/insert-link
      :leader
      "l l" #'or/org-insert-link-dwim)

(setq
 org-log-done 'time
 org-log-into-drawer t)

(setq
 org-ellipsis " ⬎ "
 org-list-allow-alphabetical t
 org-hide-emphasis-markers t)

(add-to-list 'org-modules 'org-habit)
(add-to-list 'org-modules 'org-contacts)
(add-to-list 'org-modules 'org-checklist)
(add-to-list 'org-modules 'org-drill)

(use-package! org-ol-tree
  :config
  (map! :map org-mode-map
        :localleader
        "O" #'org-ol-tree))

(setq org-directory "~/my-stuff/Org/")

(setq
 org-priority-lowest ?D
 org-priority-highest ?A
 org-priority-faces
 '((?A . error)
   (?B . warning)
   (?C . success)
   (?D . outline-4)))

(after! org-fancy-priorities
  (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕")))

(setq org-agenda-property-position 'next-line)

(after! org
  (setq org-refile-targets '(("~/my-stuff/Org/Archive.org" :maxlevel . 4))))

(advice-add 'org-refile :after 'org-save-all-org-buffers)

(add-hook 'org-mode-hook #'+org-pretty-mode)

(after! org
  (setq
   org-startup-folded 'content
   org-startup-with-inline-images t))

(use-package! org-table-sticky-header
  :defer t
  :hook (org-mode . org-table-sticky-header-mode))

(require 'ob-shell)

(after! org-superstar
  (setq
   org-superstar-headline-bullets-list '("⬢" "⬡" "◆" "◈" "◇" "●" "◉" "○" "✹" "✿" "✤" "✜")
   org-superstar-remove-leading-stars t
   org-superstar-special-todo-items t
   org-superstar-todo-bullet-alist
   '(("TODO"      . ?)
     ("NEXT"      . ?)
     ("PROJ"      . ?)
     ("WAIT"      . ?)
     ("CANCELLED" . ?)
     ("DONE"      . ?))
   org-superstar-item-bullet-alist
   '((?- . ?•)
     (?+ . ?➤))))

(setq org-tag-alist
      '((:startgrouptag)
        ("TOC"      . ?T)
        (:endgrouptag)
        (:startgrouptag)
        ("@school"  . ?s)
        ("exam"     . ?t)
        (:endgrouptag)
        (:startgrouptag)
        ("@home"    . ?h)
        ("homework" . ?H)
        (:endgrouptag)
        (:startgrouptag)
        ("@outside" . ?o)
        ("english"  . ?e)
        (:endgrouptag)))

(after! org
  (setq
   org-todo-keywords
   '((sequence
      "TODO(t)"
      "NEXT(n)"
      "PROJ(p)"
      "|"
      "WAIT(w)"
      "DONE(d)"
      "CANCELLED(c)"))
   org-todo-keyword-faces
   '(("TODO"      . (:foreground "#f78c6c" :inherit 'bold))
     ("NEXT"      . (:foreground "#ff5370" :inherit 'bold :height 1.15))
     ("PROJ"      . (:foreground "#5fafff" :inherit 'bold))
     ("WAIT"      . (:foreground "#eeffff" :inherit 'bold))
     ("DONE"      . (:foreground "#c3e88d" :inherit 'bold :box "#c3e88d"))
     ("CANCELLED" . (:foreground "#717cb4" :inherit 'bold :strike-through t)))))

(defun org-to-lower ()
  "Convert all #+KEYWORDS to #+keywords."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (let ((count 0)
          (case-fold-search nil))
      (while (re-search-forward "^[ \t]*#\\+[A-Z_]+" nil t)
        (unless (s-matches-p "RESULTS" (match-string 0))
          (replace-match (downcase (match-string 0)) t)
          (setq count (1+ count))))
      (message "Replaced %d occurances" count))))

(custom-set-faces
  '(org-level-1 ((t (:inherit outline-1 :height 1.5))))
  '(org-level-2 ((t (:inherit outline-2 :height 1.4))))
  '(org-level-3 ((t (:inherit outline-3 :height 1.3))))
  '(org-level-4 ((t (:inherit outline-4 :height 1.2))))
  '(org-level-5 ((t (:inherit outline-5 :height 1.1))))
  '(org-level-6 ((t (:inherit outline-6 :height 1.0)))))

(toc-org-mode)
(setq toc-org-max-depth 4)

(use-package! org-inline-pdf
  :config
  (add-hook 'org-mode-hook #'org-inline-pdf-mode))

(map! :leader
      "m D" #'org-display-inline-images)

(setq deft-directory "~/my-stuff/Org/")

(setq
 org-roam-directory "~/my-stuff/Org/Roam"
 org-roam-completion-everywhere t
 +org-roam-open-buffer-on-find-file nil)

(setq org-roam-dailies-directory "Journal/")
