config.org
**** Capture templates
#+begin_src emacs-lisp
(setq org-roam-capture-templates
      '(("d" "default" plain "%?"
         :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
         :unnarrowed t))
      org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%H:%M>: %?" :target
          (file+head "%<%Y-%m-%d>.org" "#+title: Journal-%<%Y-%m-%d>\n#+category: Journal-%<%Y-%m-%d>\n#+filetags: Journal\n\n"))))
#+end_src
**** Keybinds
#+begin_src emacs-lisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(map! :i "C-c n i" #'org-roam-node-insert
      :i "C-c n I" #'org-roam-node-insert-immediate)
#+end_src
**** Org agenda
#+begin_src emacs-lisp
(defun orr/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun orr/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
          (seq-filter
           (orr/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun orr/org-roam-refresh-agenda-list ()
  (interactive)
  (setq! org-agenda-files (orr/org-roam-list-notes-by-tag "Journal"))
  (appendq! org-agenda-files '("/home/m3/my-stuff/Org/Agenda/")))

(orr/org-roam-refresh-agenda-list)
#+end_src
** Parrot
#+begin_src emacs-lisp
(use-package! parrot
  :config
  (parrot-mode)
  (setq parrot-rotate-dict
        '((:rot ("yes"     "no") :caps t :upcase t)
          (:rot ("left"    "right") :caps t :upcase t)
          (:rot ("min"     "max") :caps t :upcase t)
          (:rot ("on"      "off") :caps t :upcase t)
          (:rot ("prev"    "next") :caps t :upcase t)
          (:rot ("start"   "stop") :caps t :upcase t)
          (:rot ("true"    "false") :caps t :upcase t)
          (:rot ("t"       "nil"))
          (:rot ("&&"      "||"))
          (:rot ("=="      "!="))
          (:rot (">="      "<="))
          (:rot ("."       "->"))
          (:rot ("if"      "else"))
          (:rot ("ifdef"   "ifndef"))
          (:rot ("short"   "int"      "long"))
          (:rot ("float"   "double"))
          (:rot ("int8_t"  "int16_t"  "int32_t"     "int64_t"))
          (:rot ("uint8_t" "uint16_t" "uint32_t"    "uint64_t"))))
  (parrot-set-parrot-type 'emacs)
  (map! :leader
        :n "t u" #'parrot-rotate-next-word-at-point
        :n "t i" #'parrot-rotate-prev-word-at-point))
#+end_src
** Projectile
#+begin_src emacs-lisp
(map! :desc "Ripgrep on projects"
      "C-;" #'+default/search-project)
(setq projectile-ignored-projects '("~/" "/tmp/" "~/.emacs.d/"))
#+end_src
** Rainbow mode
#+begin_src emacs-lisp
(map! :leader
      :desc "Toggle rainbow mode"
      "t c" #'rainbow-mode)

(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+end_src
** Vertico
#+begin_src emacs-lisp
(map! :leader "l r" #'vertico-repeat)
#+end_src
*** Posframe
#+begin_src emacs-lisp
(vertico-posframe-mode)
#+end_src
*** Consult
#+begin_src emacs-lisp
(defun consult-set-font ()
  "Select xfont."
  (interactive)
  (set-frame-font
   (completing-read "Choose font:"
                    (x-list-fonts "*"))))

(map! :leader
      "," #'consult-buffer
      "<" #'consult-buffer-other-window)

(after! consult
  (consult-customize
   consult-buffer :preview-key (kbd "C-,")
   consult-buffer-other-window :preview-key (kbd "C-,")))
#+end_src
*** Affe
#+begin_src emacs-lisp
(use-package! affe
  :after orderless
  :config
  (consult-customize
   affe-grep
   :prompt "Search in Project  ")
  (consult-customize
   affe-find
   :prompt "Find file in Project  "))
#+end_src
** Parens
*** Smartparens
#+begin_src emacs-lisp
(sp-local-pair
 '(org-mode)
 "<<" ">>"
 :actions '(insert))
#+end_src
** Splits
#+begin_src emacs-lisp
(map! :leader
      :desc "Clone indirect buffer other window"
      "b c" #'clone-indirect-buffer-other-window)

(map! :map evil-window-map
      "SPC" #'rotate-layout)

(setq
 evil-vsplit-window-right t
 evil-split-window-below t
 window-divider-default-bottom-width 0
 window-divider-default-right-width 0)
(set-fringe-mode 0)
#+end_src
** Select window
#+begin_src emacs-lisp
(custom-set-faces!
  '(aw-leading-char-face
    :foreground "#82aaff"
    :weight bold :height 3.5))
#+end_src
** Super save
#+begin_src emacs-lisp
(super-save-mode +1)
(setq super-save-idle-duration 10)
#+end_src
** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-palenight
      doom-themes-treemacs-theme "doom-colors")
#+end_src
** Vterm
#+begin_src emacs-lisp
(set-popup-rule! "^\\*vterm" :size 0.20 :vslot -4 :select t :quit nil :ttl 0)
#+end_src
** Which key
#+begin_src emacs-lisp
(setq
 which-key-idle-delay 0.3)
(after! which-key (setq-hook! 'which-key-init-buffer-hook line-spacing 0))

(use-package! transient-posframe
  :config
  (transient-posframe-mode))
#+end_src
** World time
#+begin_src emacs-lisp
(setq display-time-world-list
  '(("Etc/UTC" "UTC")
    ("Europe/Prague" "Prague")
    ("America/New_York" "New York")
    ("Europe/Athens" "Athens")
    ("Pacific/Auckland" "Auckland")
    ("Asia/Shanghai" "Shanghai")))
(setq display-time-world-time-format "%a, %d %b %I:%M %R %Z")
#+end_src
** Calendar
#+begin_src emacs-lisp
(setq calendar-date-style "european"
      calendar-day-abbrev-array '["Mon" "Tue" "Wed" "Thu" "Fri" "Sat" "Sun"])
#+end_src
** Page break lines
#+begin_src emacs-lisp
(global-page-break-lines-mode)
#+end_src
** Info colors
#+begin_src emacs-lisp
(add-hook 'Info-selection-hook 'info-colors-fontify-node)
#+end_src
* Init
:PROPERTIES:
:header-args: emacs-lisp: :tangle no
:END:
** Modules
*** Input
#+name: doom-input
#+begin_src emacs-lisp
;;chinese
;;japanese
;;layout            ; auie,ctsrnm is the superior home row
#+end_src
*** Completion
#+name: doom-completion
#+begin_src emacs-lisp
;;(company
;;  +childframe)      ; the ultimate code completion backend
;;helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
;;ivy               ; a search engine for love and life
(vertico
  +icons)           ; the search engine of the future
#+end_src
*** Ui
#+name: doom-ui
#+begin_src emacs-lisp
deft                ; notational velocity for Emacs
doom                ; what makes DOOM look the way it does
doom-dashboard      ; a nifty splash screen for Emacs
;;doom-quit         ; DOOM quit-message prompts when you quit Emacs
(emoji +unicode
       +github
       +ascii)      ; 🙂
hl-todo             ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
hydra
;;indent-guides     ; highlighted indent columns
;;(ligatures +extra)  ; ligatures and symbols to make your code pretty again
;;minimap           ; show a map of the code on the side
modeline            ; snazzy, Atom-inspired modeline, plus API
nav-flash           ; blink cursor line after big motions
;;neotree           ; a project drawer, like NERDTree for vim
ophints             ; highlight the region an operation acts on
(popup +defaults)   ; tame sudden yet inevitable temporary windows
;;tabs              ; a tab bar for Emacs
treemacs            ; a project drawer, like neotree but cooler
;;unicode           ; extended unicode support for various languages
vc-gutter           ; vcs diff in the fringe
vi-tilde-fringe     ; fringe tildes to mark beyond EOB
(window-select
 +numbers)          ; visually switch windows
workspaces          ; tab emulation, persistence & separate workspaces
;;zen               ; distraction-free coding or writing
#+end_src
*** Editor
#+name: doom-editor
#+begin_src emacs-lisp
(evil +everywhere)  ; come to the dark side, we have cookies
file-templates      ; auto-snippets for empty files
;;fold              ; (nigh) universal code folding
;;(format +onsave)  ; automated prettiness
;;god               ; run Emacs commands without modifier keys
;;lispy             ; vim for lisp, for people who don't like vim
;;multiple-cursors  ; editing in many places at once
;;objed             ; text object editing for the innocent
;;parinfer          ; turn lisp into python, sort of
;;rotate-text       ; cycle region at point between text candidates
snippets            ; my elves. They type so I don't have to
;;word-wrap         ; soft wrapping with language-aware indent
#+end_src
*** Emacs
#+name: doom-emacs
#+begin_src emacs-lisp
(dired +icons)      ; making dired pretty [functional]
electric            ; smarter, keyword-based electric-indent
;;(ibuffer +icons)  ; interactive buffer management
undo                ; persistent, smarter undo for your inevitable mistakes
vc                  ; version-control and Emacs, sitting in a tree
#+end_src
*** Term
#+name: doom-term
#+begin_src emacs-lisp
;;eshell            ; the elisp shell that works everywhere
;;shell             ; simple shell REPL for Emacs
;;term              ; basic terminal emulator for Emacs
vterm               ; the best terminal emulation in Emacs
#+end_src
*** Checkers
#+name: doom-checkers
#+begin_src emacs-lisp
syntax              ; tasing you for every semicolon you forget
;;(spell +flyspell) ; tasing you for misspelling mispelling
;;grammar           ; tasing grammar mistake every you make
#+end_src
*** Tools
#+name: doom-tools
#+begin_src emacs-lisp
;;ansible
;;(debugger +lsp)   ; FIXME stepping through code, to help you add bugs
;;direnv
;;docker
;;editorconfig      ; let someone else argue about tabs vs spaces
;;ein               ; tame Jupyter notebooks with emacs
(eval +overlay)     ; run code, run (also, repls)
;;gist              ; interacting with github gists
lookup              ; navigate your code and its documentation
;;lsp
magit               ; a git porcelain for Emacs
;;make              ; run make tasks from Emacs
pass                ; password manager for nerds
pdf                 ; pdf enhancements
;;prodigy           ; FIXME managing external services & code builders
rgb                 ; creating color strings
;;taskrunner        ; taskrunner for all your projects
;;terraform         ; infrastructure as code
;;tmux              ; an API for interacting with tmux
;;upload            ; map local to remote projects via ssh/ftp
#+end_src
*** Os
#+name: doom-os
#+begin_src emacs-lisp
(:if IS-MAC macos)  ; improve compatibility with macOS
;;tty               ; improve the terminal Emacs experience
#+end_src
