config.el

(setq org-roam-capture-templates
      '(("d" "default" plain "%?"
         :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
         :unnarrowed t))
      org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%H:%M>: %?" :target
          (file+head "%<%Y-%m-%d>.org" "#+title: Journal-%<%Y-%m-%d>\n#+category: Journal-%<%Y-%m-%d>\n#+filetags: Journal\n\n"))))

(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

(map! :i "C-c n i" #'org-roam-node-insert
      :i "C-c n I" #'org-roam-node-insert-immediate)

(defun orr/org-roam-filter-by-tag (tag-name)
  (lambda (node)
    (member tag-name (org-roam-node-tags node))))

(defun orr/org-roam-list-notes-by-tag (tag-name)
  (mapcar #'org-roam-node-file
          (seq-filter
           (orr/org-roam-filter-by-tag tag-name)
           (org-roam-node-list))))

(defun orr/org-roam-refresh-agenda-list ()
  (interactive)
  (setq! org-agenda-files (orr/org-roam-list-notes-by-tag "Journal"))
  (appendq! org-agenda-files '("/home/m3/my-stuff/Org/Agenda/")))

(orr/org-roam-refresh-agenda-list)

(use-package! parrot
  :config
  (parrot-mode)
  (setq parrot-rotate-dict
        '((:rot ("yes"     "no") :caps t :upcase t)
          (:rot ("left"    "right") :caps t :upcase t)
          (:rot ("min"     "max") :caps t :upcase t)
          (:rot ("on"      "off") :caps t :upcase t)
          (:rot ("prev"    "next") :caps t :upcase t)
          (:rot ("start"   "stop") :caps t :upcase t)
          (:rot ("true"    "false") :caps t :upcase t)
          (:rot ("t"       "nil"))
          (:rot ("&&"      "||"))
          (:rot ("=="      "!="))
          (:rot (">="      "<="))
          (:rot ("."       "->"))
          (:rot ("if"      "else"))
          (:rot ("ifdef"   "ifndef"))
          (:rot ("short"   "int"      "long"))
          (:rot ("float"   "double"))
          (:rot ("int8_t"  "int16_t"  "int32_t"     "int64_t"))
          (:rot ("uint8_t" "uint16_t" "uint32_t"    "uint64_t"))))
  (parrot-set-parrot-type 'emacs)
  (map! :leader
        :n "t u" #'parrot-rotate-next-word-at-point
        :n "t i" #'parrot-rotate-prev-word-at-point))

(map! :desc "Ripgrep on projects"
      "C-;" #'+default/search-project)
(setq projectile-ignored-projects '("~/" "/tmp/" "~/.emacs.d/"))

(map! :leader
      :desc "Toggle rainbow mode"
      "t c" #'rainbow-mode)

(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))

(map! :leader "l r" #'vertico-repeat)

(vertico-posframe-mode)

(defun consult-set-font ()
  "Select xfont."
  (interactive)
  (set-frame-font
   (completing-read "Choose font:"
                    (x-list-fonts "*"))))

(map! :leader
      "," #'consult-buffer
      "<" #'consult-buffer-other-window)

(after! consult
  (consult-customize
   consult-buffer :preview-key (kbd "C-,")
   consult-buffer-other-window :preview-key (kbd "C-,")))

(use-package! affe
  :after orderless
  :config
  (consult-customize
   affe-grep
   :prompt "Search in Project  ")
  (consult-customize
   affe-find
   :prompt "Find file in Project  "))

(sp-local-pair
 '(org-mode)
 "<<" ">>"
 :actions '(insert))

(map! :leader
      :desc "Clone indirect buffer other window"
      "b c" #'clone-indirect-buffer-other-window)

(map! :map evil-window-map
      "SPC" #'rotate-layout)

(setq
 evil-vsplit-window-right t
 evil-split-window-below t
 window-divider-default-bottom-width 0
 window-divider-default-right-width 0)
(set-fringe-mode 0)

(custom-set-faces!
  '(aw-leading-char-face
    :foreground "#82aaff"
    :weight bold :height 3.5))

(super-save-mode +1)
(setq super-save-idle-duration 10)

(setq doom-theme 'doom-palenight
      doom-themes-treemacs-theme "doom-colors")

(set-popup-rule! "^\\*vterm" :size 0.20 :vslot -4 :select t :quit nil :ttl 0)

(setq
 which-key-idle-delay 0.3)
(after! which-key (setq-hook! 'which-key-init-buffer-hook line-spacing 0))

(use-package! transient-posframe
  :config
  (transient-posframe-mode))

(setq display-time-world-list
  '(("Etc/UTC" "UTC")
    ("Europe/Prague" "Prague")
    ("America/New_York" "New York")
    ("Europe/Athens" "Athens")
    ("Pacific/Auckland" "Auckland")
    ("Asia/Shanghai" "Shanghai")))
(setq display-time-world-time-format "%a, %d %b %I:%M %R %Z")

(setq calendar-date-style "european"
      calendar-day-abbrev-array '["Mon" "Tue" "Wed" "Thu" "Fri" "Sat" "Sun"])

(global-page-break-lines-mode)

(add-hook 'Info-selection-hook 'info-colors-fontify-node)
