config.org
*** Lang
#+name: doom-lang
#+begin_src emacs-lisp
;;agda              ; types of types of types of types...
;;beancount         ; mind the GAAP
cc                  ; C > C++ == 1
;;clojure           ; java with a lisp
;;common-lisp       ; if you've seen one lisp, you've seen them all
;;coq               ; proofs-as-programs
;;crystal           ; ruby at the speed of c
;;csharp            ; unity, .NET, and mono shenanigans
;;data              ; config/data formats
;;(dart +flutter)   ; paint ui and not much else
;;elixir            ; erlang done right
;;elm               ; care for a cup of TEA?
emacs-lisp          ; drown in parentheses
;;erlang            ; an elegant language for a more civilized age
;;ess               ; emacs speaks statistics
;;faust             ; dsp, but you get to keep your soul
;;fsharp            ; ML stands for Microsoft's Language
;;fstar             ; (dependent) types and (monadic) effects and Z3
;;gdscript          ; the language you waited for
go                  ; the hipster dialect
;;(haskell +dante)  ; a language that's lazier than I am
;;hy                ; readability of scheme w/ speed of python
;;idris             ; a language you can depend on
;;json              ; At least it ain't XML
;;(java +meghanada) ; the poster child for carpal tunnel syndrome
;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
;;julia             ; a better, faster MATLAB
;;kotlin            ; a better, slicker Java(Script)
(latex +latexmk
       +cdlatex
       +fold)       ; writing papers in Emacs has never been so fun
;;lean
;;factor
;;ledger            ; an accounting system in Emacs
;;lua               ; one-based indices? one-based indices
markdown            ; writing docs for people to ignore
;;nim               ; python + lisp at the speed of c
;;nix               ; I hereby declare "nix geht mehr!"
;;ocaml             ; an objective camel
(org +pretty
     +gnuplot
     +brain
     +roam2)        ; organize your plain life in plain text
;;php               ; perl's insecure younger brother
;;plantuml          ; diagrams for confusing people more
;;purescript        ; javascript, but functional
;;python            ; beautiful is better than ugly
;;qt                ; the 'cutest' gui framework ever
;;racket            ; a DSL for DSLs
;;raku              ; the artist formerly known as perl6
;;rest              ; Emacs as a REST client
;;rst               ; ReST in peace
;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
;;rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
;;scala             ; java, but good
;;scheme            ; a fully conniving family of lisps
;;sh                 ; she sells {ba,z,fi}sh shells on the C xor
;;sml
;;solidity          ; do you need a blockchain? No.
;;swift             ; who asked for emoji variables?
;;terra             ; Earth and Moon in alignment for performance.
;;web               ; the tubes
;;yaml              ; JSON, but readable
zig                 ; C, but simpler
#+end_src
*** Email
#+name: doom-email
#+begin_src emacs-lisp
;;(mu4e +gmail)
;;notmuch
;;(wanderlust +gmail)
#+end_src
*** App
#+name: doom-app
#+begin_src emacs-lisp
calendar
;;emms
;;everywhere         ; *leave* Emacs!? You must be joking
;;irc               ; how neckbeards socialize
rss                 ; emacs as an RSS reader
;;twitter           ; twitter client https://twitter.com/vnought
#+end_src
*** Config
#+name: doom-config
#+begin_src emacs-lisp
literate
(default +bindings +smartparens)
#+end_src
** init.el
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export
(doom! :input
       <<doom-input>>

       :completion
       <<doom-completion>>

       :ui
       <<doom-ui>>

       :editor
       <<doom-editor>>

       :emacs
       <<doom-emacs>>

       :term
       <<doom-term>>

       :checkers
       <<doom-checkers>>

       :tools
       <<doom-tools>>

       :os
       <<doom-os>>

       :lang
       <<doom-lang>>

       :email
       <<doom-email>>

       :app
       <<doom-app>>

       :config
       <<doom-config>>
       )
#+end_src
* Packages
:PROPERTIES:
:header-args: emacs-lisp: :tangle packages.el
:END:
** Dired
#+begin_src emacs-lisp
(package! dired-hide-dotfiles)
(package! dired-open)
(package! dired-toggle)
(package! dired-single)
#+end_src
** Elfeed
#+begin_src emacs-lisp
(package! elfeed-goodies)
#+end_src
** Evil
#+begin_src emacs-lisp
(package! smart-semicolon)
#+end_src
** Org
#+begin_src emacs-lisp
(package! org-appear)
(package! org-agenda-property)
(package! org-autolist)
(package! org-auto-tangle)
(package! org-table-sticky-header)
(package! org-fragtog)
(package! literate-calc-mode)
(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
(package! org-inline-pdf)
(package! org-inline-anim)
#+end_src
** Parrot
#+begin_src emacs-lisp
(package! parrot)
#+end_src
** Regexp
#+begin_src emacs-lisp
(package! visual-regexp)
(package! visual-regexp-steroids)
#+end_src
** Rotate
#+begin_src emacs-lisp
(package! rotate)
#+end_src
** Snippets
#+begin_src emacs-lisp
(package! doom-snippets :ignore t)
#+end_src
** Super save
#+begin_src emacs-lisp
(package! super-save)
#+end_src
** Whitespace
#+begin_src emacs-lisp
(package! leerzeichen)
#+end_src
** Posframe
#+begin_src emacs-lisp
(package! transient-posframe)
(package! vertico-posframe)
#+end_src
** Completion
#+begin_src emacs-lisp
(package! cape)
(package! affe)
(package! corfu)
(package! corfu-doc :recipe (:host github :repo "galeo/corfu-doc"))
(package! kind-icon)
#+end_src
** Page break lines
#+begin_src emacs-lisp
(package! page-break-lines)
#+end_src
** Info colors
#+begin_src emacs-lisp
(package! info-colors)
#+end_src
