packages.el
(package! dired-hide-dotfiles)
(package! dired-open)
(package! dired-toggle)
(package! dired-single)

(package! elfeed-goodies)

(package! smart-semicolon)

(package! org-appear)
(package! org-agenda-property)
(package! org-autolist)
(package! org-auto-tangle)
(package! org-table-sticky-header)
(package! org-fragtog)
(package! literate-calc-mode)
(package! org-ol-tree :recipe (:host github :repo "Townk/org-ol-tree"))
(package! org-inline-pdf)
(package! org-inline-anim)

(package! parrot)

(package! visual-regexp)
(package! visual-regexp-steroids)

(package! rotate)

(package! doom-snippets :ignore t)

(package! super-save)

(package! leerzeichen)

(package! transient-posframe)
(package! vertico-posframe)

(package! cape)
(package! affe)
(package! corfu)
(package! corfu-doc :recipe (:host github :repo "galeo/corfu-doc"))
(package! kind-icon)

(package! page-break-lines)

(package! info-colors)
